app/controllers/stores_controller.rb

SELECT "stores".* FROM "stores"  WHERE (name like '%the%' or description like '%the%')  ORDER BY "stores"."name" ASC
---
  def index
    if params[:search]
      @stores = Store.search(params[:search]).order(name: :asc)

SELECT  "stores".* FROM "stores"  WHERE "stores"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @store = Store.find(params[:id])

INSERT INTO "stores" ("address", "created_at", "description", "name", "phone_number", "picture_content_type", "picture_file_name", "picture_file_size", "picture_updated_at", "updated_at", "web_address") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save

UPDATE "stores" SET "updated_at" = ?, "web_address" = ? WHERE "stores"."id" = 13  [["updated_at", "2015-01-28 04:19:38.462409"], ["web_address", "www.cool.com/throwmedown"]]
---
  def update
    respond_to do |format|
      if @store.update(store_params)

DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 2]]
---
  def destroy
    @store.destroy